//SETEXCH JOB (ACCT),'SETEXCH',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//RUN EXEC PGM=SETXCH,PARM='EUREuro                1.0000E00'
//*Link libraries
//STEPLIB DD DSN=&SYSUID..BANK.LOAD,DISP=SHR
//SYSOUT    DD SYSOUT=*,OUTLIM=15000
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY