//GETUSERS JOB (ACCT),'GETUSERS',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//RUN EXEC PGM=GETUSERS
//*Link VSAM file
//ACCOUNTS DD DSN=&SYSUID..BANK.USERS.ACCOUNTS,DISP=SHR
//*Link libraries
//STEPLIB DD DSN=&SYSUID..BANK.LOAD,DISP=SHR
//SYSOUT    DD SYSOUT=*,OUTLIM=15000
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
