//GETEXCH JOB (ACCT),'GETEXCH',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//RUN EXEC PGM=GETXCH
//*Link VSAM file
//EXCHANGE DD DSN=&SYSUID..BANK.EXCHANGE,DISP=SHR
//*Link libraries
//STEPLIB DD DSN=&SYSUID..BANK.LOAD,DISP=SHR
//SYSOUT    DD SYSOUT=*,OUTLIM=15000
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
